{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Alternaria Leaf Spot",
    "1": "Anthracnose",
    "2": "Black Spot leaf disease",
    "3": "Botrytis Blight",
    "4": "Chlorosis",
    "5": "Curl Leaf",
    "6": "Die black",
    "7": "Downy Mildew",
    "8": "Healthy",
    "9": "Leaf Blight",
    "10": "Leaf Necrosis",
    "11": "Leaf Spot",
    "12": "Mosaic Virus",
    "13": "Powdery Mildew",
    "14": "Rust",
    "15": "Septoria Leaf Spot",
    "16": "Sooty mold",
    "17": "Sooty mould"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Alternaria Leaf Spot": 0,
    "Anthracnose": 1,
    "Leaf Necrosis": 10,
    "Leaf Spot": 11,
    "Mosaic Virus": 12,
    "Powdery Mildew": 13,
    "Rust": 14,
    "Septoria Leaf Spot": 15,
    "Sooty mold": 16,
    "Sooty mould": 17,
    "Black Spot leaf disease": 2,
    "Botrytis Blight": 3,
    "Chlorosis": 4,
    "Curl Leaf": 5,
    "Die black": 6,
    "Downy Mildew": 7,
    "Healthy": 8,
    "Leaf Blight": 9
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 32,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2"
}
